app/views/ads/favourite.html.erb

<% else %>
    <% owner = User.find(@id).username %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 2], ["LIMIT", 1]]