app/views/favourites/index.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
        <% book = Ad.find(relation.ad_id) %>
        <% owner = User.find(book.user_id) %>