app/views/home/_chat.html.erb

SELECT "messages".* FROM "messages" WHERE "messages"."chat_id" = $1  [["chat_id", 1]]
---
        <ul class="jumbotron message_box">
            <% c.messages.each do |m|%>