app/views/home/admin_panel.html.erb

        </h4>
        <% User.all.order('id').each do |user| %>
---
SELECT "users".* FROM "users" ORDER BY id