app/views/home/ads_list.html.erb

      <br>
      <% owner = User.find(ad.user_id).username %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 2], ["LIMIT", 1]]