app/views/home/welcome.html.erb

						<%= ad_gift.identifier.tr('[', '').tr(']','').tr('"', '').tr(',','') %>
						<% owner = User.find(ad_gift.user_id).username %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]