app/controllers/chats_controller.rb

    def receive
        puts("ChatController#receive:::received a message")
        @answer = {}
        @chat = Chat.find(params["msg"]["chat_id"])

        new_message = Message.create()
---
SELECT  "chats".* FROM "chats" WHERE "chats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "messages" ("created_at", "updated_at", "text", "from", "chat_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2018-05-28 08:26:55.071901"], ["updated_at", "2018-05-28 08:26:55.071901"], ["text", "anche io ti penso"], ["from", 1], ["chat_id", 1]]

    def create_chat

        owner = current_user
        guest = User.find(params[:guest_id])

        c = Chat.create(owner:owner,guest:guest)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 2], ["LIMIT", 1]]
INSERT INTO "chats" ("created_at", "updated_at", "owner_id", "guest_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2018-06-04 09:37:09.047704"], ["updated_at", "2018-06-04 09:37:09.047704"], ["owner_id", 2], ["guest_id", 3]]

    def delete_chat
        @answer = {}
        @chat = Chat.find(params["chat_id"])

        owner_id = @chat.owner.id
        guest_id = @chat.guest.id

        msg = {
            type:"delete_chat",
            chat_id: @chat.id
        }

        ActionCable.server.broadcast(
            "mailbox_#{owner_id}",
            msg
        )

        ActionCable.server.broadcast(
            "mailbox_#{guest_id}",
            msg
        )

        @chat.destroy
---
SELECT  "chats".* FROM "chats" WHERE "chats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "chats" WHERE "chats"."id" = $1  [["id", 1]]