app/controllers/favourites_controller.rb

SELECT "favourites".* FROM "favourites" WHERE "favourites"."user_id" = $1 AND "favourites"."ad_id" = $2  [["user_id", 3], ["ad_id", 1]]
INSERT INTO "favourites" ("user_id", "ad_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 3], ["ad_id", 1], ["created_at", "2018-06-05 15:24:58.761256"], ["updated_at", "2018-06-05 15:24:58.761256"]]
---
    def create
        ad_id = params[:id][:book]
        if Favourite.where(:user_id => current_user.id, :ad_id => ad_id)[0]
            flash[:alert] = 'Annuncio Già presente nella tua lista!'
            redirect_to profile_path(:id => current_user.id)
        else
            favourite = Favourite.create!(:user_id => current_user.id, :ad_id => ad_id)

SELECT "favourites".* FROM "favourites" WHERE "favourites"."user_id" = $1  [["user_id", 2]]
---
    def index
        @favourites = Favourite.where(:user_id => current_user.id)

DELETE FROM "favourites" WHERE "favourites"."id" = $1  [["id", 2]]
---
    def destroy
        id = params[:id]
        Favourite.destroy(id)