app/controllers/home_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show_profile  # serve per mostrare il profilo di alti utenti quindi non carico le chat
        id = params[:id]
        @user = User.find_by_id(id)