app/controllers/home_controller.rb

SELECT "users".* FROM "users" WHERE (username like'%%')
SELECT COUNT(*) FROM "users" WHERE (username like'%%')
---
    def users_list
        @user = params[:search][0].downcase #uso il downcase per eliminare le ricerche case-sensitive
        @users = User.where( "username like?", "%#{@user}%") #ORDINARE?
        if @users.size.zero?