app/controllers/home_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
    def profile
        @user = User.find(params[:id])

SELECT "users".* FROM "users" WHERE (username iLIKE'%name_test%')
SELECT COUNT(*) FROM "users" WHERE (username iLIKE'%"name_test"%')
---
    def users_list
        @user = params[:search][0].downcase #uso il downcase per eliminare le ricerche case-sensitive
        @users = User.where( "username like?", "%#{@user}%") #ORDINARE?
        if @users.size.zero?