app/controllers/notifications_controller.rb

SELECT "notifications".* FROM "notifications" WHERE "notifications"."user_id" = $1  [["user_id", 2]]
---
    def index
        @ads = Array.new
        current_user.notifications.each do |n|