app/views/_ads_list.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---

        <% owner = User.find(ad.user_id) %>