app/views/_ads_list.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 175], ["LIMIT", 1]]
---

        <% owner = User.find(ad.user_id) %>