app/controllers/users/registrations_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "users" SET "role" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["role", "admin"], ["updated_at", "2018-06-02 15:46:05.475123"], ["id", 4]]
---
  def admin_user
    user = User.find(params[:id_admin])
    user.role = "admin"
    user.save