app/controllers/users/registrations_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT "chats".* FROM "chats" WHERE (owner_id = 4 OR guest_id = 4)
DELETE FROM "chats" WHERE "chats"."id" = $1  [["id", 2]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 5]]
---
  def admin_destroy_user
    user = User.find(params[:id])
    chats = user.chats
    chats.each do |c|
      c.destroy
    end
    user.destroy